In [14]:
import numpy as np

In [15]:
import pandas as pd

In [16]:
n = np.array([1,2,3,4,40])

In [18]:
x = pd.Series(n)

In [19]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [20]:
type(x)

pandas.core.series.Series

In [22]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [24]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [25]:
b[0]

1

In [26]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [29]:
a= pd.Series([])
b= pd.Series([1,2,33,47,58,100])
c= pd.Series((45,89,20,30,44))
d= pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\pc\AppData\Local\Temp\ipykernel_13452\2201563166.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a= pd.Series([])

In [30]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [31]:
d['d']

99

In [32]:
d['b':'d']

b    15
c    56
d    99
dtype: int64

In [33]:
s=pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [34]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [37]:
s1=pd.Series([12,52,42,10,23],index=list('qwert'))

In [38]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [41]:
s2=pd.Series([12,52,12,52,10,23,42,10,23])

In [42]:
s2

0    12
1    52
2    12
3    52
4    10
5    23
6    42
7    10
8    23
dtype: int64

In [43]:
s2.value_counts()

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [44]:
s2.argmax()

1

In [45]:
s2.argmin()

4

In [46]:
s1.idxmax()

'w'

In [47]:
s1.idxmin()

'r'

## DataFrame

In [51]:
a = pd.DataFrame()
b = pd.DataFrame([1,2,55,40,86])

In [53]:
a

Empty DataFrame
Columns: []
Index: []

In [54]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [55]:
type(b)

pandas.core.frame.DataFrame

In [57]:
c = pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [58]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [60]:
d = pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[7,8,9,10,11],[55,65,75,85,95],[85,96,35,44,78]])

In [61]:
d

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  55  65  75  85  95
4  85  96  35  44  78

In [64]:
d.head()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  55  65  75  85  95
4  85  96  35  44  78

In [65]:
d.tail()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  55  65  75  85  95
4  85  96  35  44  78

In [66]:
d.tail(3)

    0   1   2   3   4
2   7   8   9  10  11
3  55  65  75  85  95
4  85  96  35  44  78

In [67]:
d.sample()

    0   1   2   3   4
4  85  96  35  44  78

In [68]:
d.sample(5)

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
3  55  65  75  85  95
4  85  96  35  44  78
2   7   8   9  10  11

In [70]:
d1 = pd.DataFrame([[1,2],[10,20,50],[7,8,9,11],[55,65],[85,96,78]])

In [71]:
d1

    0   1     2     3
0   1   2   NaN   NaN
1  10  20  50.0   NaN
2   7   8   9.0  11.0
3  55  65   NaN   NaN
4  85  96  78.0   NaN

In [72]:
d1 = pd.DataFrame([[1,2],[10,20,50],[7,np.nan,9,11],[55,65],[85,np.nan,78]])

In [73]:
d1

    0     1     2     3
0   1   2.0   NaN   NaN
1  10  20.0  50.0   NaN
2   7   NaN   9.0  11.0
3  55  65.0   NaN   NaN
4  85   NaN  78.0   NaN

In [79]:
f1 = pd.DataFrame([[1,2],[10,20,50],[7,8,9,11],[55,65],[85,96,78]],columns=['colA','colB','colC','colD'])

In [81]:
f1

   colA  colB  colC  colD
0     1     2   NaN   NaN
1    10    20  50.0   NaN
2     7     8   9.0  11.0
3    55    65   NaN   NaN
4    85    96  78.0   NaN

In [84]:
f1[['colC','colD']]

   colC  colD
0   NaN   NaN
1  50.0   NaN
2   9.0  11.0
3   NaN   NaN
4  78.0   NaN

In [85]:
f1[['colC','colD']].head(3)

   colC  colD
0   NaN   NaN
1  50.0   NaN
2   9.0  11.0

In [86]:
f1[['colC','colD']].tail(3)

   colC  colD
2   9.0  11.0
3   NaN   NaN
4  78.0   NaN

In [88]:
f1[['colC','colD']][1:3]

   colC  colD
1  50.0   NaN
2   9.0  11.0

In [89]:
f1.shape

(5, 4)

In [91]:
f1['colC'].max()

78.0

In [93]:
f1['new_col'] = [12,45,55,66,21]

In [94]:
f1

   colA  colB  colC  colD  new_col
0     1     2   NaN   NaN       12
1    10    20  50.0   NaN       45
2     7     8   9.0  11.0       55
3    55    65   NaN   NaN       66
4    85    96  78.0   NaN       21

In [96]:
f1['colE'] = f1['new_col']+ f1['colA']

In [97]:
f1

   colA  colB  colC  colD  new_col  colE
0     1     2   NaN   NaN       12    13
1    10    20  50.0   NaN       45    55
2     7     8   9.0  11.0       55    62
3    55    65   NaN   NaN       66   121
4    85    96  78.0   NaN       21   106

In [98]:
f1['colB']>50

0    False
1    False
2    False
3     True
4     True
Name: colB, dtype: bool

In [99]:
g=f1['colB']>50

In [100]:
f1[g]

   colA  colB  colC  colD  new_col  colE
3    55    65   NaN   NaN       66   121
4    85    96  78.0   NaN       21   106